espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/src/em_ebi.c
  /* Configure timing. */
#if defined(_EFM32_GECKO_FAMILY)
  EBI_ReadTimingSet(ebiInit->readSetupCycles,
                    ebiInit->readStrobeCycles,
                    ebiInit->readHoldCycles);
  EBI_WriteTimingSet(ebiInit->writeSetupCycles,
                     ebiInit->writeStrobeCycles,
                     ebiInit->writeHoldCycles);
  EBI_AddressTimingSet(ebiInit->addrSetupCycles,
                       ebiInit->addrHoldCycles);
#else
  EBI_BankReadTimingSet(ebiInit->banks,
                        ebiInit->readSetupCycles,
                        ebiInit->readStrobeCycles,
                        ebiInit->readHoldCycles);
  EBI_BankReadTimingConfig(ebiInit->banks,
                           ebiInit->readPageMode,
                           ebiInit->readPrefetch,
                           ebiInit->readHalfRE);
  EBI_BankWriteTimingSet(ebiInit->banks,
                         ebiInit->writeSetupCycles,
                         ebiInit->writeStrobeCycles,
                         ebiInit->writeHoldCycles);
  EBI_BankWriteTimingConfig(ebiInit->banks,
                            ebiInit->writeBufferDisable,
                            ebiInit->writeHalfWE);
  EBI_BankAddressTimingSet(ebiInit->banks,
                           ebiInit->addrSetupCycles,
                           ebiInit->addrHoldCycles);
  EBI_BankAddressTimingConfig(ebiInit->banks,
                              ebiInit->addrHalfALE);
#endif

  /* Activate the new configuration. */
  EBI->CTRL = ctrl;

  /* Configure Address Latch Enable. */
  switch (ebiInit->mode) {
    case ebiModeD16A16ALE:
    case ebiModeD8A24ALE:
      /* Address Latch Enable. */
      EBI_RouteBitWrite(_EBI_GENERIC_ALEPEN_SHIFT, 1);
      break;
#if defined(EBI_CTRL_MODE_D16)
    case ebiModeD16:
#endif
    case ebiModeD8A8:
      /* Make sure that Address Latch is disabled. */
      EBI_RouteBitWrite(_EBI_GENERIC_ALEPEN_SHIFT, 0);
      break;
  }

#if !defined(_EFM32_GECKO_FAMILY)
  /* Limit the pin enable. */
  EBI_GENERIC_ROUTE_REG = (EBI_GENERIC_ROUTE_REG & ~_EBI_GENERIC_ALB_MASK) | ebiInit->aLow;
  EBI_GENERIC_ROUTE_REG = (EBI_GENERIC_ROUTE_REG & ~_EBI_GENERIC_APEN_MASK) | ebiInit->aHigh;
#if defined(_EBI_ROUTE_LOCATION_MASK)
  /* Location. */
  EBI->ROUTE = (EBI->ROUTE & ~_EBI_ROUTE_LOCATION_MASK) | ebiInit->location;
#endif

  /* Enable the EBI BL pin if necessary. */
  if (ctrl & (_EBI_CTRL_BL_MASK | _EBI_CTRL_BL1_MASK | _EBI_CTRL_BL2_MASK | _EBI_CTRL_BL3_MASK)) {
    EBI_RouteBitWrite(_EBI_GENERIC_BLPEN_SHIFT, ebiInit->blEnable);
  }
#endif

  /* Enable EBI pins EBI_WEn and EBI_REn. */
  EBI_RouteBitWrite(_EBI_GENERIC_EBIPEN_SHIFT, 1);

  /* Enable chip select lines. */
  EBI_ChipSelectEnable(ebiInit->csLines, true);
}

/***************************************************************************//**
 * @brief
 *   Disable External Bus Interface
 ******************************************************************************/
void EBI_Disable(void)
{
  /* Disable pins */
  EBI_GENERIC_ROUTE_REG = _EBI_GENERIC_RESETVALUE;
  /* Disable banks */
  EBI->CTRL = _EBI_CTRL_RESETVALUE;
}

/***************************************************************************//**
 * @brief
 *   Enable or disable EBI Bank.
 *
 * @param[in] banks
 *   Banks to reconfigure, mask of EBI_BANK<n> flags.
 *
 * @param[in] enable
 *   True to enable, false to disable.
 ******************************************************************************/
void EBI_BankEnable(uint32_t banks, bool enable)
{
  if (banks & EBI_BANK0) {
    BUS_RegBitWrite(&(EBI->CTRL), _EBI_CTRL_BANK0EN_SHIFT, enable);
  }
  if (banks & EBI_BANK1) {
    BUS_RegBitWrite(&(EBI->CTRL), _EBI_CTRL_BANK1EN_SHIFT, enable);
  }
  if (banks & EBI_BANK2) {
    BUS_RegBitWrite(&(EBI->CTRL), _EBI_CTRL_BANK2EN_SHIFT, enable);
  }
  if (banks & EBI_BANK3) {
    BUS_RegBitWrite(&(EBI->CTRL), _EBI_CTRL_BANK3EN_SHIFT, enable);
  }
}

/***************************************************************************//**
 * @brief
 *   Return the base address of the EBI bank.
 *
 * @param[in] bank
 *   A bank to return the start address for.
 *
 * @return
 *   an absolute address of the bank.
 ******************************************************************************/
uint32_t EBI_BankAddress(uint32_t bank)
{
#if defined (EBI_CTRL_ALTMAP)
  if (EBI->CTRL & EBI_CTRL_ALTMAP) {
    switch (bank) {
      case EBI_BANK0:
        return EBI_MEM_BASE;

      case EBI_BANK1:
        return EBI_MEM_BASE + 0x10000000UL;

      case EBI_BANK2:
        return EBI_MEM_BASE + 0x20000000UL;

      case EBI_BANK3:
        return EBI_MEM_BASE + 0x30000000UL;

      default:
        EFM_ASSERT(0);
        break;
    }
  }
#endif
  switch (bank) {
    case EBI_BANK0:
      return EBI_MEM_BASE;

    case EBI_BANK1:
      return EBI_MEM_BASE + 0x04000000UL;

    case EBI_BANK2:
      return EBI_MEM_BASE + 0x08000000UL;

    case EBI_BANK3:
      return EBI_MEM_BASE + 0x0C000000UL;

    default:
      EFM_ASSERT(0);
      break;
  }
  return 0;
}

#if defined(_EBI_NANDCTRL_MASK)
/***************************************************************************//**
 * @brief
 *   Enable or disable EBI NAND Flash Support
 *
 * @param[in] banks
 *   Banks to reconfigure, mask of EBI_BANK<n> flags.
 *
 * @param[in] enable
 *   True to enable, false to disable.
 ******************************************************************************/
void EBI_NANDFlashEnable(uint32_t banks, bool enable)
{
  if (banks & EBI_BANK0) {
    BUS_RegBitWrite(&(EBI->NANDCTRL), _EBI_NANDCTRL_BANKSEL_SHIFT, _EBI_NANDCTRL_BANKSEL_BANK0);
  }
  if (banks & EBI_BANK1) {
    BUS_RegBitWrite(&(EBI->NANDCTRL), _EBI_NANDCTRL_BANKSEL_SHIFT, _EBI_NANDCTRL_BANKSEL_BANK1);
  }
  if (banks & EBI_BANK2) {
    BUS_RegBitWrite(&(EBI->NANDCTRL), _EBI_NANDCTRL_BANKSEL_SHIFT, _EBI_NANDCTRL_BANKSEL_BANK2);
  }
  if (banks & EBI_BANK3) {
    BUS_RegBitWrite(&(EBI->NANDCTRL), _EBI_NANDCTRL_BANKSEL_SHIFT, _EBI_NANDCTRL_BANKSEL_BANK3);
  }
  BUS_RegBitWrite(&(EBI->NANDCTRL), _EBI_NANDCTRL_EN_SHIFT, enable);
}
#endif

/***************************************************************************//**
 * @brief
 *   Enable or disable EBI Chip Select.
 *
 * @param[in] cs
 *   ChipSelect lines to reconfigure, mask of EBI_CS<n> flags.
 *
 * @param[in] enable
 *   True to enable, false to disable.
 ******************************************************************************/
void EBI_ChipSelectEnable(uint32_t cs, bool enable)
{
  if (cs & EBI_CS0) {
    EBI_RouteBitWrite(_EBI_GENERIC_CS0PEN_SHIFT, enable);
  }
  if (cs & EBI_CS1) {
    EBI_RouteBitWrite(_EBI_GENERIC_CS1PEN_SHIFT, enable);
  }
  if (cs & EBI_CS2) {
    EBI_RouteBitWrite(_EBI_GENERIC_CS2PEN_SHIFT, enable);
  }
  if (cs & EBI_CS3) {
    EBI_RouteBitWrite(_EBI_GENERIC_CS3PEN_SHIFT, enable);
  }
}

/***************************************************************************//**
 * @brief
 *   Configure EBI pin polarity.
 *
 * @param[in] line
 *   Which pin/line to configure.
 *
 * @param[in] polarity
 *   Active high or active low.
 ******************************************************************************/
void EBI_PolaritySet(EBI_Line_TypeDef line, EBI_Polarity_TypeDef polarity)
{
  switch (line) {
    case ebiLineARDY:
      BUS_RegBitWrite(&EBI->POLARITY, _EBI_POLARITY_ARDYPOL_SHIFT, polarity);
      break;
    case ebiLineALE:
      BUS_RegBitWrite(&EBI->POLARITY, _EBI_POLARITY_ALEPOL_SHIFT, polarity);
      break;
    case ebiLineWE:
      BUS_RegBitWrite(&EBI->POLARITY, _EBI_POLARITY_WEPOL_SHIFT, polarity);
      break;
    case ebiLineRE:
      BUS_RegBitWrite(&EBI->POLARITY, _EBI_POLARITY_REPOL_SHIFT, polarity);
      break;
    case ebiLineCS:
      BUS_RegBitWrite(&EBI->POLARITY, _EBI_POLARITY_CSPOL_SHIFT, polarity);
      break;
#if defined(_EBI_POLARITY_BLPOL_MASK)
    case ebiLineBL:
      BUS_RegBitWrite(&EBI->POLARITY, _EBI_POLARITY_BLPOL_SHIFT, polarity);
      break;
#endif
#if defined (_EBI_TFTPOLARITY_MASK)
    case ebiLineTFTVSync:
      BUS_RegBitWrite(&EBI->TFTPOLARITY, _EBI_TFTPOLARITY_VSYNCPOL_SHIFT, polarity);
      break;
    case ebiLineTFTHSync:
      BUS_RegBitWrite(&EBI->TFTPOLARITY, _EBI_TFTPOLARITY_HSYNCPOL_SHIFT, polarity);
      break;
    case ebiLineTFTDataEn:
      BUS_RegBitWrite(&EBI->TFTPOLARITY, _EBI_TFTPOLARITY_DATAENPOL_SHIFT, polarity);
      break;
    case ebiLineTFTDClk:
      BUS_RegBitWrite(&EBI->TFTPOLARITY, _EBI_TFTPOLARITY_DCLKPOL_SHIFT, polarity);
      break;
    case ebiLineTFTCS:
      BUS_RegBitWrite(&EBI->TFTPOLARITY, _EBI_TFTPOLARITY_CSPOL_SHIFT, polarity);
      break;
#endif
    default:
      EFM_ASSERT(0);
      break;
  }
}

/***************************************************************************//**
 * @brief
 *   Configure timing values of read bus accesses.
 *
 * @param[in] setupCycles
 *   A number of clock cycles for the address setup before REn is asserted.
 *
 * @param[in] strobeCycles
 *   The number of cycles the REn is held active. After the specified number of
 *   cycles, data is read. If set to 0, 1 cycle is inserted by hardware.
 *
 * @param[in] holdCycles
 *   The number of cycles CSn is held active after the REn is deasserted.
 ******************************************************************************/
void EBI_ReadTimingSet(uint32_t setupCycles, uint32_t strobeCycles, uint32_t holdCycles)
{
  uint32_t readTiming;

